---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.EnergyAnalysisFailures.RoomGeometryCannotFindFreeFacesBoundingElement
source: html/3fe209b6-f601-f23b-9eea-fce48e299152.htm
---
# Autodesk.Revit.DB.BuiltInFailures.EnergyAnalysisFailures.RoomGeometryCannotFindFreeFacesBoundingElement Property

An error occurred while trying to find the free part of a face of the bounding geometry for [Room] when processing the room-bounding element [Name]. The free part of the face is found by subtracting the portions of the face that overlap various room-bounding element faces.

## Syntax (C#)
```csharp
public static FailureDefinitionId RoomGeometryCannotFindFreeFacesBoundingElement { get; }
```